In [1]:
import pandas as pd

csv_file = pd.read_csv('imdb_id.csv')
csv_file.shape

(230255, 1)

In [2]:
csv_file.heda(10)

      tconst
0  tt0000502
1  tt0000574
2  tt0000591
3  tt0000615
4  tt0000630
5  tt0000675
6  tt0000679
7  tt0000739
8  tt0000793
9  tt0000814

In [3]:
csv_file.tail(10)

            tconst
230245  tt10143368
230246  tt10143498
230247  tt10143546
230248  tt10143628
230249  tt10143938
230250  tt10144160
230251  tt10144174
230252  tt10144202
230253  tt10144210
230254  tt10144276

In [6]:
id_list = csv_file.loc[200000:]
id_list.tail(10)

            tconst
230245  tt10143368
230246  tt10143498
230247  tt10143546
230248  tt10143628
230249  tt10143938
230250  tt10144160
230251  tt10144174
230252  tt10144202
230253  tt10144210
230254  tt10144276

In [7]:
id_list.shape

(30255, 1)

In [8]:
id_list.to_csv('imdb_30255.csv')

In [9]:
from sklearn.model_selection import train_test_split
train, test = train_test_split(id_list, test_size=0.2, random_state=777)

In [10]:
train.shape

(24204, 1)

In [11]:
test.shape

(6051, 1)

In [12]:
train.to_csv('imdb_train.csv')

In [ ]:
test.to_csv('imdb_test.csv')

In [2]:
import pandas as pd

test = pd.read_csv('./data/imdb_test.csv')
test.shape

(6051, 1)

In [3]:
train = pd.read_csv('./data/imdb_train.csv')
train.shape

(24204, 1)

In [4]:
test.tail(10)

          tconst
6041   tt0950779
6042   tt0459471
6043   tt0438388
6044  tt10009638
6045  tt10060528
6046   tt0842759
6047   tt0445597
6048   tt0918514
6049   tt0465067
6050   tt0929411

In [6]:
test = test.loc[1000:]
test.tail(10)

          tconst
6041   tt0950779
6042   tt0459471
6043   tt0438388
6044  tt10009638
6045  tt10060528
6046   tt0842759
6047   tt0445597
6048   tt0918514
6049   tt0465067
6050   tt0929411

In [7]:
test.to_csv('imdb_test.csv')

In [8]:
test = pd.read_csv('./data/imdb_test.csv')
test.shape

(5051, 2)

In [9]:
test.tail(10)

      Unnamed: 0      tconst
5041        6041   tt0950779
5042        6042   tt0459471
5043        6043   tt0438388
5044        6044  tt10009638
5045        6045  tt10060528
5046        6046   tt0842759
5047        6047   tt0445597
5048        6048   tt0918514
5049        6049   tt0465067
5050        6050   tt0929411

In [10]:
test = test.loc[2000:]
test.tail(10)

      Unnamed: 0      tconst
5041        6041   tt0950779
5042        6042   tt0459471
5043        6043   tt0438388
5044        6044  tt10009638
5045        6045  tt10060528
5046        6046   tt0842759
5047        6047   tt0445597
5048        6048   tt0918514
5049        6049   tt0465067
5050        6050   tt0929411

In [15]:
test.shape

(3051, 2)

In [12]:
test.to_csv('imdb_test.csv')

In [13]:
train = pd.read_csv('./data/imdb_train.csv')
train.shape

(24204, 1)

In [14]:
test = test.loc[2000:]
test.to_csv('imdb_test.csv')

In [17]:
test.shape

(3051, 2)

In [26]:
test = test.loc[2000:]

In [27]:
test.shape

(3000, 2)

In [29]:
test = pd.read_csv('./data/imdb_test.csv')
test.shape

(3051, 1)

In [30]:
test = test.loc[2051:]

In [31]:
test.shape

(1000, 1)

In [32]:
test.to_csv('imdb_test.csv')

In [41]:
train = pd.read_csv('./data/imdb_train.csv')
train.shape

(3000, 2)

In [38]:
train = train.loc[21204:]

In [39]:
train.shape

(3000, 1)

In [40]:
train.to_csv('imdb_train.csv')